emacs/.config/emacs/Emacs.org
#+TITLE: Emacs.org
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Early Init 配置
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./early-init.el
:END:

** 定义 XDG 目录

#+begin_src emacs-lisp
  ;; 定义 XDG 目录变量
  (defvar xdg-data-home (or (getenv "XDG_DATA_HOME")
        			  (expand-file-name "~/.local/share")))
  (defvar xdg-state-home (or (getenv "XDG_STATE_HOME")
        			   (expand-file-name "~/.local/state")))
#+end_src


** 设置 elpa 目录位置

#+begin_src emacs-lisp
  ;; 设置 elpa 目录位置
  (setq package-user-dir (expand-file-name "emacs/elpa" xdg-data-home))
  (make-directory package-user-dir t)
#+end_src

** 设置 auto-save 目录位置
#+begin_src emacs-lisp
  ;; 设置 auto-save 目录位置
  (setq auto-save-list-file-prefix
        (expand-file-name "emacs/auto-save-list/.saves-" xdg-state-home))
  (make-directory (file-name-directory auto-save-list-file-prefix) t)

#+end_src

** UI 设置

#+begin_src emacs-lisp
(setq inhibit-startup-message t)  ; 禁用启动画面
(menu-bar-mode -1)        ; 禁用菜单栏
(tool-bar-mode -1)        ; 禁用工具栏
(scroll-bar-mode -1)      ; 禁用滚动条

(setq visible-bell t)     ; 可视化 Bell


#+end_src

* 备份配置

#+begin_src emacs-lisp
  ;; 设置备份文件位置
  (let ((backup-dir (expand-file-name "emacs/backups" xdg-state-home)))
    (setq backup-directory-alist (list (cons "." backup-dir)))
    (make-directory backup-dir t))

  ;; 保留最近5次备份
  (setq version-control t) ; 启用版本控制
  (setq kept-new-versions 5) ; 保留最近5个版本
  (setq kept-old-versions 0) ; 不保留旧版本
  (setq delete-old-versions t) ; 自动删除超出的版本
#+end_src

* Custom-file 配置

custom.el 存储的是:

- 通过 Customize 界面设置的选项值
- 主题、字体等用户偏好
- 标记为安全的 file-local variables

#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))
#+end_src

* UI 设置

#+begin_src emacs-lisp
(set-fringe-mode 10)      ; 边缘留白
(tooltip-mode -1)         ; 禁用提示框
#+end_src

* 软件包配置

#+begin_src emacs-lisp
(require 'package)
(setq package-archives '(("gnu"    . "https://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
                         ("nongnu" . "https://mirrors.tuna.tsinghua.edu.cn/elpa/nongnu/")
                         ("melpa"  . "https://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")))
(package-initialize)

(require 'use-package)

(setq use-package-always-ensure t)    ; 自动安装缺少的插件
#+end_src

* 主题设置

#+begin_src emacs-lisp
  (use-package doom-themes
    :ensure t
    :custom
    (doom-themes-enable-bold t)
    (doom-themes-enable-italic t)

    :config
    (load-theme 'doom-nord t)

    (doom-themes-org-config))
#+end_src

* 字体配置

#+begin_src emacs-lisp
(set-face-attribute 'default nil :font "Maple Mono NF CN-15")
#+end_src

* 配置 Babel

#+begin_src emacs-lisp
(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)))
#+end_src

#+RESULTS:
  
* 配置自动生成
:PROPERTIES:
:tangle: no
:END:

这是一个构建脚本。当保存此 Org 文件时，Emacs 会自动读取底部的 Local Variables，并触发 org-babel-tangle 来生成配置文件。

# Local Variables:
# eval: (add-hook 'after-save-hook (lambda () (let ((org-confirm-babel-evaluate nil)) (org-babel-tangle))) nil t)
# End:
